In [1]:
import numpy as np
import pandas as pd

In [2]:
#apply applymap
df = pd.DataFrame(np.random.randn(5,4))
df

          0         1         2         3
0  0.679610  1.394642 -0.259877 -0.790623
1  0.571070  0.723271 -0.420349  1.576403
2  0.723506 -1.370237 -0.365628 -0.470977
3 -0.173305  0.232578 -0.242469 -0.636997
4  0.523569  0.984887 -0.610207  1.026262

In [3]:
np.abs(df)

          0         1         2         3
0  0.679610  1.394642  0.259877  0.790623
1  0.571070  0.723271  0.420349  1.576403
2  0.723506  1.370237  0.365628  0.470977
3  0.173305  0.232578  0.242469  0.636997
4  0.523569  0.984887  0.610207  1.026262

In [5]:
#通过apply将函数运用到列或者行
f = lambda x: x.max()
df.apply(f)#每一列的最大值
#默认axis=0

0    0.723506
1    1.394642
2   -0.242469
3    1.576403
dtype: float64

In [6]:
df.apply(f,axis=1)

0    1.394642
1    1.576403
2    0.723506
3    0.232578
4    1.026262
dtype: float64

In [7]:
#通过applymap将函数运用到每个数据上
f2 = lambda x: '%.2f'%x #保留两位小数
df.applymap(f2)

       0      1      2      3
0   0.68   1.39  -0.26  -0.79
1   0.57   0.72  -0.42   1.58
2   0.72  -1.37  -0.37  -0.47
3  -0.17   0.23  -0.24  -0.64
4   0.52   0.98  -0.61   1.03

In [9]:
#排序sort
#按索引排序
s1 = pd.Series(np.arange(4),index=list('dbca'))
s1

d    0
b    1
c    2
a    3
dtype: int32

In [10]:
s1.sort_index()#默认升序

a    3
b    1
c    2
d    0
dtype: int32

In [11]:
s1.sort_index(ascending = False)

d    0
c    2
b    1
a    3
dtype: int32

In [12]:
pd1 = pd.DataFrame(np.arange(12).reshape(4,3),index=list('bdca'),columns=list('DCA'))
pd1

   D   C   A
b  0   1   2
d  3   4   5
c  6   7   8
a  9  10  11

In [13]:
pd1.sort_index()#按照行排序

   D   C   A
a  9  10  11
b  0   1   2
c  6   7   8
d  3   4   5

In [14]:
pd1.sort_index(axis=1)#按照列排序

    A   C  D
b   2   1  0
d   5   4  3
c   8   7  6
a  11  10  9

In [15]:
s1.sort_values()

d    0
b    1
c    2
a    3
dtype: int32

In [17]:
s1['a']= np.nan
s1

d    0.0
b    1.0
c    2.0
a    NaN
dtype: float64

In [18]:
s1.sort_values()#nan默认排最后

d    0.0
b    1.0
c    2.0
a    NaN
dtype: float64

In [19]:
s1.sort_values(ascending = False)

c    2.0
b    1.0
d    0.0
a    NaN
dtype: float64

In [20]:
pd1

   D   C   A
b  0   1   2
d  3   4   5
c  6   7   8
a  9  10  11

In [24]:
pd2 = pd.DataFrame({'a':[3,7,9,0],'b':[1,-1,4,8],'c':[0,6,-2,4]})
pd2

   a  b  c
0  3  1  0
1  7 -1  6
2  9  4 -2
3  0  8  4

In [26]:
pd2.sort_values(by=['a','c'],ascending = False)

   a  b  c
2  9  4 -2
1  7 -1  6
0  3  1  0
3  0  8  4

In [27]:
# 唯一值 成员属性
s1 = pd.Series([2,6,8,9,8,3,6])
s1

0    2
1    6
2    8
3    9
4    8
5    3
6    6
dtype: int64

In [29]:
s2 = s1.unique() #返回一个数组
s2

array([2, 6, 8, 9, 3], dtype=int64)

In [31]:
s1.index.is_unique

True

In [33]:
s1.value_counts()

8    2
6    2
9    1
2    1
3    1
dtype: int64

In [37]:
s1.isin([8])#判断8是否存在

0    False
1    False
2     True
3    False
4     True
5    False
6    False
dtype: bool

In [35]:
s1.isin([8,2])

0     True
1    False
2     True
3    False
4     True
5    False
6    False
dtype: bool

In [38]:
data = pd.DataFrame({'a':[3,7,9,0],'b':[1,-1,4,8],'c':[0,6,-2,4]})
data

   a  b  c
0  3  1  0
1  7 -1  6
2  9  4 -2
3  0  8  4

In [39]:
data.isin([2,4])

       a      b      c
0  False  False  False
1  False  False  False
2  False   True  False
3  False  False   True

In [41]:
#处理缺失数据
df3 = pd.DataFrame([np.random.randn(3),
                    [1.,2.,np.nan],
                   [np.nan,4.,np.nan],
                    [1.,2.,3.,]])
df3

          0         1         2
0  0.370538 -1.155023  1.763425
1  1.000000  2.000000       NaN
2       NaN  4.000000       NaN
3  1.000000  2.000000  3.000000

In [42]:
# 1.判断是否存在nan
df3.isnull()

       0      1      2
0  False  False  False
1  False  False   True
2   True  False   True
3  False  False  False

In [43]:
# 2. 如何丢弃缺失数据
df3.dropna()

          0         1         2
0  0.370538 -1.155023  1.763425
3  1.000000  2.000000  3.000000

In [44]:
df3.dropna(axis=1)

          1
0 -1.155023
1  2.000000
2  4.000000
3  2.000000

In [45]:
#填充缺失数据
df3.fillna(-1.)

          0         1         2
0  0.370538 -1.155023  1.763425
1  1.000000  2.000000 -1.000000
2 -1.000000  4.000000 -1.000000
3  1.000000  2.000000  3.000000